simpkins/ausb/ausb/esp/Esp32Device.cpp
// Copyright (c) 2023, Adam Simpkins
#include "ausb/esp/Esp32Device.h"

#include <esp_check.h>
#include <esp_log.h>
#include <hal/usb_hal.h>
#include <soc/usb_otg_periph.h>
#include <soc/usb_periph.h>
#include <soc/usb_pins.h>

#include <atomic>
#include <cinttypes>
#include <cstring>

#define AUSB_VERBOSE_LOGGING

#ifdef AUSB_VERBOSE_LOGGING
#define DBG_ISR_LOG(arg, ...) ESP_EARLY_LOGI(LogTag, arg, ##__VA_ARGS__)
#else
#define DBG_ISR_LOG(arg, ...) (static_cast<void>(0))
#endif

namespace {
const char *LogTag = "ausb.esp32";

// These helper functions avoid compiler warnings about using |= or &= on
// volatile integers.
inline void set_bits(volatile uint32_t &value, uint32_t bits) {
  value = (value | bits);
}
inline void clear_bits(volatile uint32_t &value, uint32_t bits) {
  value = (value & ~bits);
}

template<class... Ts> struct overloaded : Ts... { using Ts::operator()...; };
template<class... Ts> overloaded(Ts...) -> overloaded<Ts...>;

// The definitions for some of the endpoint register fields appears to be
// incorrect in soc/usb_reg.h.  It looks like some of the settings were
// copy-and-pasted from endpoint 0 to all other endpoints, but the other
// endpoints should be using different values for several fields in DIEPCTL,
// DIEPTSIZ, DOEPCTL, and DOEPTSIZ.
// (https://github.com/espressif/esp-idf/issues/12710)
constexpr uint32_t Correct_USB_D_MPS1_V = 0x7FF;
constexpr uint32_t Correct_USB_D_MPS1_M =
    (Correct_USB_D_MPS1_V << USB_D_MPS1_S);
constexpr uint32_t Correct_USB_D_PKTCNT1_V = 0x3FF;
constexpr uint32_t Correct_USB_D_PKTCNT1_M =
    (Correct_USB_D_PKTCNT1_V << USB_D_PKTCNT1_S);
constexpr uint32_t Correct_USB_D_XFERSIZE1_V = 0x7FFFF;
constexpr uint32_t Correct_USB_D_XFERSIZE1_M =
    (Correct_USB_D_XFERSIZE1_V << USB_D_XFERSIZE1_S);

constexpr uint32_t Correct_USB_MPS1_V = 0x7FF;
constexpr uint32_t Correct_USB_MPS1_M =
    (Correct_USB_MPS1_V << USB_MPS1_S);
constexpr uint32_t Correct_USB_PKTCNT1_V = 0x3FF;
constexpr uint32_t Correct_USB_PKTCNT1_M =
    (Correct_USB_PKTCNT1_V << USB_PKTCNT1_S);
constexpr uint32_t Correct_USB_XFERSIZE1_V = 0x7FFFF;
constexpr uint32_t Correct_USB_XFERSIZE1_M =
    (Correct_USB_XFERSIZE1_V << USB_XFERSIZE1_S);

} // unnamed namespace

namespace ausb {

Esp32Device::~Esp32Device() {
  reset();
}

DeviceEvent Esp32Device::wait_for_event(std::chrono::milliseconds timeout) {
  // If pending_event_ is set, we have a previously-received interrupt event
  // that still needs additional processing to be done.
  if (!std::holds_alternative<NoEvent>(pending_event_)) {
    const auto evt = pending_event_;
    pending_event_ = NoEvent(NoEventReason::Timeout);
    ESP_LOGV(LogTag, "USB wait_for_event() processing existing pending event");
    // If process_event() returns NoEvent we could potentially fall through
    // and process an event from the queue.  However, for now it's simpler to
    // just return back to the caller and let them call wait_for_event() again
    // on the next loop.
    return process_event(evt);
  }

  TickType_t max_wait = pdMS_TO_TICKS(timeout.count());
  Esp32DeviceEvent event(NoEvent(NoEventReason::Timeout));
  if (xQueueReceive(event_queue_, &event, max_wait) == pdTRUE) {
    return process_event(event);
  } else {
    return NoEvent(NoEventReason::Timeout);
  }
}

DeviceEvent Esp32Device::process_event(Esp32DeviceEvent event) {
  return std::visit(
      overloaded{[this](const NoEvent &ev) -> DeviceEvent { return ev; },
                 [this](const BusResetEvent &ev) -> DeviceEvent {
                   process_bus_reset();
                   return ev;
                 },
                 [this](const SuspendEvent &ev) -> DeviceEvent { return ev; },
                 [this](const ResumeEvent &ev) -> DeviceEvent { return ev; },
                 [this](const BusEnumDone &ev) -> DeviceEvent { return ev; },
                 [this](const SetupPacket &pkt) -> DeviceEvent { return pkt; },
                 [this](const InEndpointInterrupt &ev) -> DeviceEvent {
                   return process_in_ep_interrupt(ev.endpoint_num, ev.diepint);
                 },
                 [this](const OutEndpointInterrupt &ev) -> DeviceEvent {
                   return process_out_ep_interrupt(ev.endpoint_num, ev.doepint);
                 },
                 [this](const RxFifoNonEmpty &) -> DeviceEvent {
                   return process_rx_fifo();
                 }},
      event);
}

void Esp32Device::process_bus_reset() {
  for (size_t endpoint_num = 0; endpoint_num < in_transfers_.size();
       ++endpoint_num) {
    in_transfers_[endpoint_num].unconfigure();
  }
  for (size_t endpoint_num = 0; endpoint_num < out_transfers_.size();
       ++endpoint_num) {
    out_transfers_[endpoint_num].unconfigure();
  }
}

// Note that process_in_ep_interrupt() runs in the main USB task, and not in an
// interrupt context.  The interrupt handler simply sends the event to the main
// USB task, and this function handles it on the USB task.
DeviceEvent Esp32Device::process_in_ep_interrupt(uint8_t endpoint_num,
                                                 uint32_t diepint) {
  auto &xfer = in_transfers_[endpoint_num];
  if (xfer.status != InEPStatus::Busy) {
    // It's possible that this could happen if we recently processed
    // application-initiated request to abort the transfer and this raced with
    // us receiving the interrupt.
    ESP_LOGD(LogTag,
             "IN interrupt on endpoint %d, but transfer was no "
             "longer in progress",
             endpoint_num);
    return NoEvent(NoEventReason::HwProcessing);
  }

  // Transfer timeout
  if (diepint & USB_D_TIMEOUT0_M) {
    ESP_LOGW(LogTag, "USB IN transfer timeout on EP%u", endpoint_num);
    // TODO: flush the TX FIFO and abort the write
    xfer.reset();
    return InXferFailedEvent(endpoint_num);
  }

  // IN transfer complete
  // Note that this means a hardware transfer was complete.  The full transfer
  // requested by the application may not yet be complete if it could not fit
  // into a single HW transfer.
  if (diepint & USB_D_XFERCOMPL0_M) {
    ESP_LOGD(LogTag, "USB: IN transfer complete on EP%u", endpoint_num);
    if (xfer.cur_xfer_end == xfer.size) {
      xfer.reset();
      return InXferCompleteEvent(endpoint_num);
    } else {
      initiate_next_write_xfer(endpoint_num);
      return NoEvent(NoEventReason::HwProcessing);
    }
  }

  // FIFO empty
  // Note that this flag will usually also be set when USB_D_XFERCOMPL0_M
  // is set.  However, we only care about processing this event when
  // USB_D_XFERCOMPL0_M is not set.
  if (diepint & USB_D_TXFEMP0_M) {
    ESP_LOGD(LogTag, "TX FIFO space available on endpoint %d", endpoint_num);
    write_to_fifo(endpoint_num);
    return NoEvent(NoEventReason::HwProcessing);
  }

