simpkins/ausb/ausb/esp/Esp32Device.cpp
  // It's sort of unexpected to reach here with no flags set.
  ESP_LOGD(LogTag, "IN interrupt on endpoint %d, but no flags set",
           endpoint_num);
  return NoEvent(NoEventReason::HwProcessing);
}

DeviceEvent Esp32Device::process_out_ep_interrupt(uint8_t endpoint_num,
                                                  uint32_t doepint) {
  // Setup packet receipt done
  //
  // The hardware generates this event after we pop the SetupComplete event
  // from the RX FIFO.
  //
  // Note that when this interrupt occurs the hardware will reset the packet
  // count and byte size to 0 in the doeptsiz register, and will clear the
  // endpoint enable flag in doepctl.  These always need to be explicitly
  // updated to enable OUT transfer receipt after a SETUP packet.
  if ((doepint & USB_SETUP0_M)) {
    ESP_LOGD(LogTag, "USB OUT: SETUP receive complete on EP%u", endpoint_num);

    // If XFERCOMPL was also set (should be unlikely?), add an event back to
    // the front of the queue to process this flag the next time
    // wait_for_event() is called.
    if (doepint & USB_XFERCOMPL0_M) {
      pending_event_ =
          OutEndpointInterrupt(endpoint_num, doepint & ~USB_SETUP0_M);
    }

    // Inform the application of the SETUP packet
    return SetupPacket(setup_packet_.setup);
  }

  // OUT transfer complete
  if (doepint & USB_XFERCOMPL0_M) {
    ESP_LOGD(LogTag, "USB: OUT transaction complete on EP%u", endpoint_num);

    auto &xfer = out_transfers_[endpoint_num];
    if (xfer.status != OutEPStatus::Busy) {
      // It's possible that this could happen if we recently processed
      // application-initiated request to abort the transfer and this raced
      // with us receiving the interrupt.
      ESP_LOGD(LogTag,
               "OUT xfer complete interrupt on endpoint %d, but transfer "
               "was no longer in progress",
               endpoint_num);
      return NoEvent(NoEventReason::HwProcessing);
    }

    // TODO:
    // - if we read all data requested, or if the transfer ended due to a short
    //   packet, generate an event for the application
    // - if the HW transfer read all data requested but the SW transfer still
    //   has more data to read, call initiate_next_read_xfer() to start another
    //   HW transfer

#if 0
    auto &xfer = xfer_status_[epnum].out;
    // Transfer complete if short packet or total length is received
    if (xfer.recv_complete) {
      send_event_from_isr<OutXferCompleteEvent>(epnum, xfer.received_bytes);
    } else {
      // Enable receiving another packet on this endpoint
      set_bits(usb_->out_ep_reg[epnum].doeptsiz,
               USB_PKTCNT0_M |
                   ((xfer.max_size & USB_XFERSIZE0_V) << USB_XFERSIZE0_S));
      set_bits(usb_->out_ep_reg[epnum].doepctl, USB_EPENA0_M | USB_CNAK0_M);
    }
#endif
  }

  // FIXME
  return NoEvent(NoEventReason::HwProcessing);
}

void Esp32Device::send_event_from_isr(const Esp32DeviceEvent& event) {
  BaseType_t higher_prio_task_woken;
  BaseType_t res =
      xQueueSendToBackFromISR(event_queue_, &event, &higher_prio_task_woken);
  portYIELD_FROM_ISR(higher_prio_task_woken);

  if (res != pdPASS) {
    ESP_EARLY_LOGE(LogTag, "USB event queue full; unable to send event");
    // If a USB event is lost we can't necessarily recover from this, as our
    // state may become inconsistent.  Abort for now.
    //
    // TODO: We perhaps could keep local storage space for 1 event, then store
    // the event there and disable interrupts until the queue has been read
    // from.  The main task can then re-enable interrupts once it has freed
    // space in the queue.
    abort();
  }
}

esp_err_t Esp32Device::init(EspPhyType phy_type,
                            std::optional<gpio_num_t> vbus_monitor) {
  ESP_LOGI(LogTag, "USB device init");

  event_queue_ = xQueueCreateStatic(kMaxEventQueueSize, sizeof(DeviceEvent),
                                    queue_buffer_.data(), &queue_storage_);

  const auto err = init_phy(phy_type, vbus_monitor);
  if (err != ESP_OK) {
    return err;
  }

  // Ensure the data line pull-up is disabled as we perform initialization.
  set_bits(usb_->dctl, USB_SFTDISCON_M);

  // During initialization, send a stall on receipt of
  // any non-zero length OUT packet.  Also set speed.
  set_bits(usb_->dcfg, USB_NZSTSOUTHSHK_M | Speed::Full48Mhz);

  // Configure AHB interrupts:
  // - Global interrupts enable flag
  // - Enable periodic TxFIFO empty interrupt (recommended by STM32 reference
  //   manual)
  // - Configure the non-periodic TxFIFO empty interrupt to fire when
  //   completely empty rather than half empty
  set_bits(usb_->gahbcfg,
           USB_GLBLLNTRMSK_M | USB_PTXFEMPLVL_M | USB_NPTXFEMPLVL_M);

  // USB configuration:
  auto gusbcfg = usb_->gusbcfg;
  // We currently don't support HNP or SRP
  // Clear the timeout calibration and turnaround time bits, as we will set
  // these fields below.
  gusbcfg &= ~(USB_HNPCAP_M | USB_SRPCAP_M | USB_TOUTCAL_M | USB_USBTRDTIM_M);
  // Force device mode (rather than OTG)
  gusbcfg |= USB_FORCEDEVMODE_M;
  // Set the timeout calibration to the maximum value
  gusbcfg |= USB_TOUTCAL_M;
  // Set the USB turnaround time to 5 (recommended default value from the docs)
  gusbcfg |= (5 << USB_USBTRDTIM_S);
  usb_->gusbcfg = gusbcfg;

  // OTG configuration:
  // - disable overrides
  clear_bits(usb_->gotgctl,
             USB_BVALIDOVVAL_M | USB_BVALIDOVEN_M | USB_VBVALIDOVVAL_M);

  // Configure all endpoints to NAK
  all_endpoints_nak();

  // Flush all TX FIFOs, and wait for the flush to complete
  set_bits(usb_->grstctl, (0x10 << USB_TXFNUM_S) | USB_TXFFLSH_M);
  while (usb_->grstctl & USB_TXFFLSH_M) {
  }
  // Flush the RX FIFO, and wait for the flush to complete
  set_bits(usb_->grstctl, USB_RXFFLSH_M);
  while (usb_->grstctl & USB_RXFFLSH_M) {
  }

  // Interrupt configuration
  usb_->gintmsk = 0;          // mask all interrupts
  usb_->gotgint = 0xffffffff; // clear OTG interrupts
                              // (even though we leave OTG interrupts disabled)
  usb_->gintsts = 0xffffffff; // clear pending interrupts
  usb_->gintmsk = USB_MODEMISMSK_M | USB_OTGINTMSK_M | USB_RXFLVIMSK_M |
                  USB_ERLYSUSPMSK_M | USB_USBSUSPMSK_M | USB_USBRSTMSK_M |
                  USB_ENUMDONEMSK_M | USB_RESETDETMSK_M | USB_DISCONNINTMSK_M;

  ESP_RETURN_ON_ERROR(
      enable_interrupts(), LogTag, "error enabling USB interrupts");

