simpkins/ausb/ausb/esp/Esp32Device.cpp
  // Enable the data line pull-up to connect to the bus.
  clear_bits(usb_->dctl, USB_SFTDISCON_M);

  return ESP_OK;
}

void Esp32Device::reset() {
  usb_->gintmsk = 0; // Mask all interrupts
  usb_->daintmsk = 0;
  set_bits(usb_->dctl, USB_SFTDISCON_M); // Disable the data pull-up line

  // TODO: flush RX FIFO
  // TODO: flush all TX FIFOs
  pending_event_ = NoEvent(NoEventReason::Timeout);
  for (size_t endpoint_num = 0; endpoint_num < in_transfers_.size();
       ++endpoint_num) {
    in_transfers_[endpoint_num].reset();
  }
  for (size_t endpoint_num = 0; endpoint_num < out_transfers_.size();
       ++endpoint_num) {
    out_transfers_[endpoint_num].reset();
  }

  if (interrupt_handle_) {
    // esp_intr_free() will wait for any in-progress interrupt handlers to
    // finish before it returns.
    esp_intr_free(interrupt_handle_);
    usb_->gintmsk = 0;
    usb_->daintmsk = 0;
  }
  if (phy_) {
    usb_del_phy(phy_);
  }

  // No need to call vQueueDelete(event_queue_) here since event_queue_ was
  // allocated with xQueueCreateStatic() rather than xQueueCreate().
}

esp_err_t Esp32Device::init_phy(EspPhyType phy_type,
                                std::optional<gpio_num_t> vbus_monitor) {
  usb_phy_ext_io_conf_t ext_io_conf = {
      .vp_io_num = USBPHY_VP_NUM,
      .vm_io_num = USBPHY_VM_NUM,
      .rcv_io_num = USBPHY_RCV_NUM,
      .oen_io_num = USBPHY_OEN_NUM,
      .vpo_io_num = USBPHY_VPO_NUM,
      .vmo_io_num = USBPHY_VMO_NUM,
  };
  usb_phy_otg_io_conf_t self_powered_otg_io_conf =
      USB_PHY_SELF_POWERED_DEVICE(vbus_monitor ? *vbus_monitor : -1);
  usb_phy_config_t phy_conf = {
      .controller = USB_PHY_CTRL_OTG,
      .target = phy_type == EspPhyType::External ? USB_PHY_TARGET_EXT
                                                 : USB_PHY_TARGET_INT,
      .otg_mode = USB_OTG_MODE_DEVICE,
      .otg_speed = USB_PHY_SPEED_UNDEFINED,
      .ext_io_conf = phy_type == EspPhyType::External ? &ext_io_conf : nullptr,
      .otg_io_conf = vbus_monitor ? &self_powered_otg_io_conf : nullptr,
  };
  ESP_RETURN_ON_ERROR(
      usb_new_phy(&phy_conf, &phy_), LogTag, "error configuring USB PHY");
  return ESP_OK;
}

void Esp32Device::all_endpoints_nak() {
  // Set the NAK bit on all OUT endpoints, so they will NAK any OUT packets
  // sent by the host.
  for (int ep_num = 0; ep_num < USB_OUT_EP_NUM; ++ep_num) {
    set_bits(usb_->out_ep_reg[ep_num].doepctl, USB_DO_SNAK0_M);
  }
}

esp_err_t Esp32Device::enable_interrupts() {
  return esp_intr_alloc(ETS_USB_INTR_SOURCE, ESP_INTR_FLAG_LOWMED,
                        Esp32Device::static_interrupt_handler, this,
                        &interrupt_handle_);
}

void Esp32Device::set_address(uint8_t address) {
  auto dcfg = usb_->dcfg;
  dcfg &= ~USB_DEVADDR_M;
  dcfg |= ((address & USB_DEVADDR_V) << USB_DEVADDR_S);
  usb_->dcfg = dcfg;
}

bool Esp32Device::configure_ep0(uint8_t max_packet_size) {
  ESP_LOGI(LogTag, "configure EP0, MPS=%u", max_packet_size);
  // This method should only be called when EP0 is disabled and has not yet
  // been configured.  (e.g., after a bus reset)
  if (usb_->daintmsk & (USB_OUTEPMSK0_M | USB_INEPMSK0_M)) {
    ESP_LOGE(LogTag,
             "configure_ep0() called when endpoint 0 was already configured");
    return false;
  }
  assert(in_transfers_[0].status == InEPStatus::Unconfigured);
  assert(out_transfers_[0].status == OutEPStatus::Unconfigured);

  // Configure FIFO sizes
  // Configure the receive FIFO size.
  // Use 52 words (208 bytes), simply since this is the value that tinyusb
  // uses.  The comments in the tinyusb code appear to refer to data from
  // Synopsys technical reference manuals.
  usb_->grxfsiz = 52;
  // TX FIFO size
  // Control IN uses FIFO 0 with 64 bytes (16 32-bit words)
  usb_->gnptxfsiz = (16 << USB_NPTXFDEP_S) | (usb_->grxfsiz & 0x0000ffffUL);

  // Compute bits to set in the doepctl and diepctl registers
  EP0MaxPktSize mps_bits;
  if (max_packet_size == 64) {
    mps_bits = EP0MaxPktSize::Mps64;
  } else if (max_packet_size == 32) {
    mps_bits = EP0MaxPktSize::Mps32;
  } else if (max_packet_size == 16) {
    mps_bits = EP0MaxPktSize::Mps16;
  } else if (max_packet_size == 8) {
    mps_bits = EP0MaxPktSize::Mps8;
  } else {
    ESP_LOGE(LogTag, "configure_ep0() called with invalid max packet size %d",
             max_packet_size);
    return false;
  }
  constexpr int endpoint_num = 0;

  in_transfers_[endpoint_num].status = InEPStatus::Idle;
  out_transfers_[endpoint_num].status = OutEPStatus::Idle;

  // Set the doeptsiz register to enable receipt of SETUP packets
  set_bits(usb_->out_ep_reg[0].doeptsiz, USB_SUPCNT0_M);

  // Update doepctl
  // - Set the max packet size
  // - Enable NAK'ing any received OUT packets.  (It might be nice if we could
  //   tell the hardware to immediately start accepting OUT data as well, to
  //   avoid possibly NAK'ing the host's first OUT packet after a SETUP packet.
  //   However, even if we disable NAK'ing OUT packets here, the hardware
  //   automatically re-enables this flag after receipt of a SETUP packet, so
  //   there is no point in us trying to set it here.)
  // - We don't set USB_USBACTEP0; according to the comments in soc/usb_reg.h
  //   this flag appears unnecessary for EP0, as EP0 is always active.
  uint32_t doepctl = usb_->out_ep_reg[endpoint_num].doepctl;
  doepctl &= ~USB_MPS0_M;
  usb_->out_ep_reg[endpoint_num].doepctl =
      doepctl | (mps_bits << USB_MPS0_S) | USB_DO_SNAK0_M;

  // Update diepctl
  // - Set the max packet size
  // - Set the TX FIFO number to 0
  // - Clear the STALL bit
  uint32_t diepctl = usb_->in_ep_reg[endpoint_num].diepctl;
  diepctl &= ~(USB_D_MPS0_M | USB_D_TXFNUM0_M | USB_D_STALL0_M);
  usb_->in_ep_reg[endpoint_num].diepctl = diepctl | (mps_bits << USB_D_MPS0_S);

  // Enable receipt of endpoint IN and OUT interrupts
  set_bits(usb_->gintmsk, USB_IEPINTMSK_M | USB_OEPINTMSK_M);
  // Enable IN and OUT interrupts for EP0.
  usb_->daintmsk = USB_OUTEPMSK0_M | USB_INEPMSK0_M;

