simpkins/ausb/ausb/esp/Esp32Device.cpp
  return true;
}

void Esp32Device::stall_ep0() {
  // For EP0, we simply set the STALL flags, but leave the endpoint enabled
  set_bits(usb_->out_ep_reg[0].doepctl, USB_STALL0_M);
  set_bits(usb_->in_ep_reg[0].diepctl, USB_DI_SNAK1_M | USB_D_STALL1_M);
  flush_tx_fifo(0);
}

XferStartResult Esp32Device::start_write(uint8_t endpoint, const void *data,
                                         uint32_t size) {
  ESP_LOGD(LogTag, "start_write() %" PRIu32 " bytes on endpoint %d", size,
           endpoint);
  const auto ep_status = in_transfers_[endpoint].status;
  if (ep_status != InEPStatus::Idle) {
    if (ep_status == InEPStatus::Busy) {
      ESP_LOGW(
          LogTag,
          "start_write called on endpoint %d while an existing transfer is "
          "still in progress",
          endpoint);
      return XferStartResult::Busy;
    }
    ESP_LOGW(LogTag, "start_write called on endpoint %d in bad state %d",
             endpoint, static_cast<int>(in_transfers_[endpoint].status));
    return XferStartResult::EndpointNotConfigured;
  }

  // Record the transfer information in in_transfers_[endpoint]
  in_transfers_[endpoint].start(data, size);

  initiate_next_write_xfer(endpoint);
  return XferStartResult::Ok;
}

XferStartResult Esp32Device::start_read(uint8_t endpoint, void *data,
                                        uint32_t size) {
  ESP_LOGD(LogTag, "start_read() up to %" PRIu32 " bytes on endpoint %d", size,
           endpoint);
  const auto ep_status = out_transfers_[endpoint].status;
  if (ep_status != OutEPStatus::Idle) {
    if (ep_status == OutEPStatus::Busy) {
      ESP_LOGW(
          LogTag,
          "start_read called on endpoint %d while an existing transfer is "
          "still in progress",
          endpoint);
      return XferStartResult::Busy;
    }
    ESP_LOGW(LogTag, "start_read called on endpoint %d in bad state %d",
             endpoint, static_cast<int>(out_transfers_[endpoint].status));
    return XferStartResult::EndpointNotConfigured;
  }

  // Record the transfer information in out_transfers_[endpoint]
  out_transfers_[endpoint].start(data, size);

  initiate_next_read_xfer(endpoint);
  return XferStartResult::Ok;
}

XferStartResult Esp32Device::ack_ctrl_in() {
  // TODO: Suppress the InXferCompleteEvent / InXferFailedEvent that occurs
  // when this OUT transfer is complete.  We mainly do this to be more similar
  // to other USB implementations like the MAX3420 which have a dedicated
  // register for ACK'ing control transfers, and which do not provide
  // notification of completion.
  return start_read(0, nullptr, 0);
}

/*
 * Overall device IN transfer steps:
 * 1) Update the DIEPTSIZ register with the number of packets and total number
 *    of bytes being sent.
 * 2) Update the DIEPCTL to enable the endpoint to start transmitting.
 * 3) Write data into the TX FIFO.  We may not be able to fit everything at
 *    once, so write as many whole packets as we can, then wait for a TXFE
 *    interrupt to signal we can write more.
 * 4) Once we have written everything to the FIFO and they have actually been
 *    consumed by the host, we will get an XFERCOMPL interrupt to signal the
 *    transfer is done.
 *
 * This function updates the DIEPTSIZ and DIEPCTL registers to start a new IN
 * transfer, and then calls write_to_fifo() to start writing the data to the
 * FIFO.  The transfer information should have already been placed in
 * in_transfers_[endpoint].
 */
void Esp32Device::initiate_next_write_xfer(uint8_t endpoint_num) {
  usb_in_endpoint_t *const in_ep = &(usb_->in_ep_reg[endpoint_num]);
  uint32_t diepctl = in_ep->diepctl;
  auto& xfer = in_transfers_[endpoint_num];

  assert(xfer.status == InEPStatus::Busy);
  // We should only invoke initiate_next_write_xfer() when the hardware
  // is not currently performing a transfer and is ready to accept a new
  // transfer.  Our own tracking of the endpoint status should ensure this.
  assert((diepctl & USB_D_EPENA1_M) == 0);

  // Compute the number of packets and bytes to send in this HW transfer
  uint16_t pkts_to_send;
  uint32_t bytes_to_send;
  const auto size_remaining = xfer.size - xfer.cur_xfer_end;
  if (size_remaining == 0) {
    // This should only ever happen for the first and only call o
    // a 0-length tranfer.
    assert(xfer.size == 0);
    pkts_to_send = 1;
    bytes_to_send = 0;
  } else {
    uint16_t max_pkt_size;
    uint16_t max_pkt_cnt;
    uint32_t max_xfer_size;
    if (endpoint_num == 0) {
      // EP0 uses a different encoding for the MPS in diepctl than other
      // endpoints.
      const auto mps_bits =
          static_cast<EP0MaxPktSize>((diepctl >> USB_D_MPS0_S) & USB_D_MPS0_V);
      max_pkt_size = get_ep0_max_packet_size(mps_bits);
      max_pkt_cnt = USB_D_PKTCNT0_V;
      max_xfer_size = USB_D_XFERSIZE1_V;
    } else {
      max_pkt_size = ((diepctl >> USB_D_MPS1_S) & Correct_USB_D_MPS1_V);
      max_pkt_cnt = Correct_USB_D_PKTCNT1_V;
      max_xfer_size = Correct_USB_D_XFERSIZE1_V;
    }

    auto max_bytes_to_send = std::min(size_remaining, max_xfer_size);
    const auto pkts_left =
        (max_bytes_to_send + (max_xfer_size - 1)) / max_xfer_size;
    if (pkts_left > max_pkt_cnt) {
      pkts_to_send = max_pkt_cnt;
      bytes_to_send = pkts_to_send * max_pkt_size;
    } else {
      pkts_to_send = pkts_left;
      bytes_to_send = max_bytes_to_send;
    }
  }

  ESP_LOGV(LogTag,
           "start IN XFER on endpoint %d: %" PRIu16 " packets, %" PRIu32
           " bytes",
           endpoint_num, pkts_to_send, bytes_to_send);
  xfer.cur_xfer_end += bytes_to_send;

  // Now start the HW transfer
  in_ep->dieptsiz =
      (pkts_to_send << USB_D_PKTCNT1_S) | (bytes_to_send << USB_D_XFERSIZE1_S);
  // TODO: for isochronous endpoints we may need to set USB_DI_SETD0PID1 or
  // USB_DI_SETD1PID1 appropriately in diepctl.
  in_ep->diepctl = diepctl | USB_D_EPENA1_M | USB_D_CNAK1_M;

  if (bytes_to_send > 0) {
    write_to_fifo(endpoint_num);
  }
}

void Esp32Device::initiate_next_read_xfer(uint8_t endpoint_num) {
  usb_out_endpoint_t *const out_ep = &(usb_->out_ep_reg[endpoint_num]);
  uint32_t doepctl = out_ep->doepctl;
  auto& xfer = out_transfers_[endpoint_num];

  assert(xfer.status == OutEPStatus::Busy);
  // We should only invoke initiate_next_write_xfer() when the hardware
  // is not currently performing a transfer and is ready to start a new
  // transfer.  Our own tracking of the endpoint status should ensure this.
  assert((doepctl & USB_EPENA1_M) == 0);

  uint16_t max_pkt_size;
  uint16_t max_pkt_cnt;
  uint32_t max_xfer_size;
  if (endpoint_num == 0) {
    // EP0 uses a different encoding for the MPS in doepctl than other
    // endpoints.
    const auto mps_bits =
        static_cast<EP0MaxPktSize>((doepctl >> USB_MPS0_S) & USB_MPS0_V);
    max_pkt_size = get_ep0_max_packet_size(mps_bits);
    max_pkt_cnt = USB_PKTCNT0_V;
    max_xfer_size = USB_XFERSIZE0_V;
  } else {
    max_pkt_size = ((doepctl >> USB_MPS1_S) & Correct_USB_MPS1_V);
    max_pkt_cnt = Correct_USB_PKTCNT1_V;
    max_xfer_size = Correct_USB_XFERSIZE1_V;
  }

  // If max_pkt_size is not a multiple of 4, it needs to be rounded up since
  // data is written into the FIFO in whole words.
  uint16_t fifo_pkt_size = (max_pkt_size + static_cast<uint16_t>(3)) & 0xfffc;

  // Compute the number of packets to ask the hardware to receive
  uint32_t pkts_to_read;
  const auto size_remaining = xfer.capacity - xfer.bytes_read;
  if (size_remaining == 0) {
    // This should only ever happen for the first and only call o
    // a 0-length tranfer.
    assert(xfer.capacity == 0);
    pkts_to_read = 1;
  } else {
    // Adjust max_pkt_cnt to ensure our full transfer cannot exceed
    // max_xfer_size if we transferred this many full packets.
    max_pkt_cnt = static_cast<uint16_t>(std::min(
        static_cast<uint32_t>(max_pkt_cnt), max_xfer_size / fifo_pkt_size));

    pkts_to_read = (size_remaining + max_pkt_size - 1) / max_pkt_size;
    if (pkts_to_read > max_pkt_cnt) {
      pkts_to_read = max_pkt_cnt;
    }
  }
  const uint32_t bytes_to_read = pkts_to_read * fifo_pkt_size;

  ESP_LOGV(LogTag,
           "start OUT XFER on endpoint %d: up to %" PRIu32 " packets, %" PRIu32
           " bytes",
           endpoint_num, pkts_to_read, bytes_to_read);

