simpkins/ausb/ausb/esp/Esp32Device.cpp
  // Now set doeptsiz and doepctl to ask the hardware to
  // start accepting OUT packets
  set_bits(out_ep->doeptsiz, (pkts_to_read << USB_PKTCNT1_S) |
                                 (bytes_to_read << USB_XFERSIZE1_S));
  set_bits(out_ep->doepctl, USB_EPENA0_M | USB_CNAK0_M);
}

uint16_t Esp32Device::get_max_in_pkt_size(uint8_t endpoint_num, uint32_t diepctl) {
  if (endpoint_num == 0) {
    const auto mps_bits =
        static_cast<EP0MaxPktSize>((diepctl >> USB_D_MPS0_S) & USB_D_MPS0_V);
    return get_ep0_max_packet_size(mps_bits);
  } else {
    return ((diepctl >> USB_D_MPS1_S) & Correct_USB_D_MPS1_V);
  }
}

uint8_t Esp32Device::get_ep0_max_packet_size(EP0MaxPktSize mps_bits) {
  switch (mps_bits) {
  case EP0MaxPktSize::Mps64:
    return 64;
  case EP0MaxPktSize::Mps32:
    return 32;
  case EP0MaxPktSize::Mps16:
    return 16;
  case EP0MaxPktSize::Mps8:
    return 8;
  }

  // Shouldn't really be possible to reach here.
  return 64;
}

/*
 * Write more data from the current in_transfers_[endpoint_num] to the FIFO.
 *
 * Will write data up to the cur_xfer_end.  Updates the cur_fifo_ptr field of
 * the transfer based on how much data was written to the FIFO.  This method
 * should only be called when cur_fifo_ptr is less than cur_xfer_end.
 *
 * If not all data could be written, this enables the TXFE interrupt.  Once the
 * TXFE interrupt is seen, write_to_fifo() should be called again to write more
 * data.
 */
void Esp32Device::write_to_fifo(uint8_t endpoint_num) {
  usb_in_endpoint_t *const in_ep = &(usb_->in_ep_reg[endpoint_num]);
  uint32_t diepctl = in_ep->diepctl;
  auto& xfer = in_transfers_[endpoint_num];

  assert((diepctl & USB_D_EPENA1_M) != 0);
  uint8_t const fifo_num = ((diepctl >> USB_D_TXFNUM1_S) & USB_D_TXFNUM1_V);
  const auto max_packet_size = get_max_in_pkt_size(endpoint_num, diepctl);
  const auto tx_words_avail =
      (in_ep->dtxfsts & USB_D_INEPTXFSPCAVAIL0_M) >> USB_D_INEPTXFSPCAVAIL0_S;
  auto tx_space_avail = tx_words_avail * 4;
  ESP_LOGV(LogTag, "write_to_fifo() on endpoint %d: tx_space_avail=%" PRIu32,
           endpoint_num, tx_space_avail);

  while (true) {
    const auto bytes_left = xfer.cur_xfer_end - xfer.cur_fifo_ptr;
    if (bytes_left <= 0) {
      break;
    }
    const uint16_t pkt_size =
        std::min(bytes_left, static_cast<uint32_t>(max_packet_size));

    if (tx_space_avail < pkt_size) {
      // We have more data to send, but no more room in the FIFO at the moment.
      // Enable the TXFE interrupt for this endpoint so we will be notified
      // when the FIFO is empty.
      ESP_LOGV(LogTag,
               "endpoint %d TX FIFO is full, enabling FIFO empty interrupt",
               endpoint_num);
      set_bits(usb_->dtknqr4_fifoemptymsk, 1 << endpoint_num);
      return;
    }

    copy_pkt_to_fifo(
        fifo_num, static_cast<const uint8_t *>(xfer.data) + xfer.cur_fifo_ptr,
        pkt_size);
    xfer.cur_fifo_ptr += pkt_size;
    tx_space_avail -= pkt_size;
    ESP_LOGV(LogTag, "copied packet of size %" PRIu16 " to endpoint %d FIFO %d",
             pkt_size, endpoint_num, fifo_num);
  }
}

/*
 * Copy a single packet into a TX FIFO.
 */
void Esp32Device::copy_pkt_to_fifo(uint8_t fifo_num, const void *data,
                                   uint16_t pkt_size) {
  volatile uint32_t *tx_fifo = usb_->fifo[fifo_num];
  const uint16_t whole_words = pkt_size / 4;
  if ((reinterpret_cast<intptr_t>(data) % 4) == 0) {
    const uint32_t* data32 = static_cast<const uint32_t*>(data);
    for (uint16_t n = 0; n < whole_words; ++n) {
      (*tx_fifo) = data32[n];
      ESP_LOGV(LogTag, "  aligned write word %" PRIu16, n);
    }
  } else {
    // Handle writing unaligned input data
    const uint8_t* data8 = static_cast<const uint8_t*>(data);
    const uint16_t end = whole_words * 4;
    for (uint16_t n = 0; n < end; n += 4) {
      uint32_t word = data8[n] | (data8[n + 1] << 8) | (data8[n + 2] << 16) |
                      (data8[n + 3] << 24);
      (*tx_fifo) = word;
      ESP_LOGV(LogTag, "  unaligned write word %" PRIu16, n);
    }
  }

  // Handle any remaining data less than a full word
  const uint16_t idx = whole_words * 4;
  if (idx < pkt_size) {
    ESP_LOGV(LogTag, "  write tail difference %" PRIu16 " - %" PRIu16, pkt_size,
             idx);
    const uint8_t* tail = static_cast<const uint8_t*>(data) + idx;
    uint32_t word = tail[0];
    if (idx + 1 < pkt_size) {
      word |= (tail[1] << 8);
    }
    if (idx + 2 < pkt_size) {
      word |= (tail[2] << 16);
    }
    (*tx_fifo) = word;
  }
}

void Esp32Device::stall_in_endpoint(uint8_t endpoint_num) {
  assert(endpoint_num != 0);
  usb_in_endpoint_t *const in_ep = &(usb_->in_ep_reg[endpoint_num]);

  if ((endpoint_num == 0) || !(in_ep->diepctl & USB_D_EPENA1_M)) {
    // If the endpoint is not currently enabled, we just have to set the STALL
    // flag, and don't need to disable it.
    set_bits(in_ep->diepctl, USB_DI_SNAK1_M | USB_D_STALL1_M);
  } else {
    // Set USB_DI_SNAK1_M to NAK transfers.
    set_bits(in_ep->diepctl, USB_DI_SNAK1_M);
    while ((in_ep->diepint & USB_DI_SNAK1_M) == 0) {
      // Busy loop until we observe the USB_DI_SNAK1_M interrupt flag.
      // TODO: It would ideally be nicer to make this API asynchronous, and
      // finish the operation in the interrupt handler rather than busy
      // looping.
    }

    // Disable the endpoint and also set the STALL flag.
    // NAK is also still set.
    set_bits(in_ep->diepctl,
             USB_DI_SNAK1_M | USB_D_STALL1_M | USB_D_EPDIS1_M);
    while ((in_ep->diepint & USB_D_EPDISBLD0_M) == 0) {
      // Busy loop until we observe the USB_D_EPDISBLD0_M interrupt flag.
    }
    // Clear the USB_D_EPDISBLD0_M interrupt.
    in_ep->diepint = USB_D_EPDISBLD0_M;
  }

  // Flush the transmit FIFO.
  flush_tx_fifo(endpoint_num);
}

void Esp32Device::flush_tx_fifo(uint8_t endpoint_num) {
  usb_in_endpoint_t *const in_ep = &(usb_->in_ep_reg[endpoint_num]);
  uint8_t const fifo_num =
      ((in_ep->diepctl >> USB_D_TXFNUM1_S) & USB_D_TXFNUM1_V);
  set_bits(usb_->grstctl, fifo_num << USB_TXFNUM_S);
  set_bits(usb_->grstctl, USB_TXFFLSH_M);
  while ((usb_->grstctl & USB_TXFFLSH_M) != 0) {
    // Busy loop until the FIFO has been cleared.
  }
}

void Esp32Device::stall_out_endpoint(uint8_t endpoint_num) {
  assert(endpoint_num != 0);
  usb_out_endpoint_t *const out_ep = &(usb_->out_ep_reg[endpoint_num]);

  if (!(out_ep->doepctl & USB_EPENA0_M)) {
    // If the endpoint is not currently enabled, nothing else to do besides set
    // the STALL flag.
    set_bits(out_ep->doepctl, USB_STALL0_M);
  } else {
    // The Global NAK flag apparently must be enabled to STALL an OUT
    // endpoint.  Enable this flag, and wait for it to take effect.
    set_bits(usb_->dctl, USB_SGOUTNAK_M);
    while ((usb_->gintsts & USB_GOUTNAKEFF_M) == 0) {
      // Busy loop until we have seen the USB_GOUTNAKEFF_M interrupt.
      // TODO: It would ideally be nicer to make this API asynchronous, and
      // finish the operation in the interrupt handler rather than busy
      // looping.
    }

    // Disable the endpoint, and set the STALL flag.
    set_bits(out_ep->doepctl, USB_STALL0_M | USB_EPDIS0_M);
    while ((out_ep->doepint & USB_EPDISBLD0_M) == 0) {
      // Busy loop until we have seen the endpoint disabled interrupt.
    }
    out_ep->doepint = USB_EPDISBLD0_M;

    // Clear the Global NAK flag to allow other OUT endpoints to continue
    // functioning.
    set_bits(usb_->dctl, USB_CGOUTNAK_M);
  }
}

void Esp32Device::static_interrupt_handler(void *arg) {
  auto *dev = static_cast<Esp32Device *>(arg);
  dev->intr_main();
}

void Esp32Device::intr_main() {
  const uint32_t mask = usb_->gintmsk;
  const uint32_t int_status = (usb_->gintsts & mask);
  DBG_ISR_LOG("USB interrupt: 0x%02" PRIx32 " 0x%02" PRIx32, mask, int_status);

