simpkins/ausb/ausb/esp/Esp32Device.cpp
  // Check int_status for all of the interrupt bits that we need to handle.
  // As we process each interrupt, set that bit in gintsts to clear the
  // interrupt.  Do this before sending the event back to the main task, as
  // send_event_from_isr() may yield back to another higher priority task
  // before returning.

  if (int_status & (USB_USBRST_M | USB_RESETDET_M)) {
    // USB_USBRST_M indicates a reset.
    // USB_RESETDET_M indicates a reset detected while in suspend mode.
    //
    // These two tend to be asserted together when first initializing the bus
    // as a device.
    usb_->gintsts = USB_USBRST_M | USB_RESETDET_M;
    intr_bus_reset();
  }

  if (int_status & USB_ENUMDONE_M) {
    usb_->gintsts = USB_ENUMDONE_M;
    intr_enum_done();
  }

  if (int_status & USB_ERLYSUSP_M) {
    DBG_ISR_LOG("USB int: early suspend");
    // TODO: might need to check for USB_ERRTICERR in the dsts register?
    // According to some of the STM docs it looks like erratic errors can
    // trigger an early suspend interrupt with the erratic error status flag
    // set.  We need to then do a soft disconnect to recover.
    usb_->gintsts = USB_ERLYSUSP_M;
  }

  if (int_status & USB_USBSUSP_M) {
    DBG_ISR_LOG("USB int: suspend");
    usb_->gintsts = USB_USBSUSP_M;
    send_event_from_isr<SuspendEvent>();
  }

  if (int_status & USB_WKUPINT_M) {
    DBG_ISR_LOG("USB int: resume");
    usb_->gintsts = USB_WKUPINT_M;
    send_event_from_isr<ResumeEvent>();
  }

  if (int_status & USB_DISCONNINT_M) {
    usb_->gintsts = USB_DISCONNINT_M;
    DBG_ISR_LOG("USB disconnect");
  }

  if (int_status & USB_SOF_M) {
    // Start of frame.
    //
    // We only enable SOF interupts to detect when the bus has resumed after we
    // have triggered a remote wakeup.  Re-disable SOF interrupts, and then
    // send a resume event to the main event handler.
    DBG_ISR_LOG("USB int: start of frame");
    usb_->gintsts = USB_SOF_M;
    clear_bits(usb_->gintmsk, USB_SOFMSK_M);
    send_event_from_isr<ResumeEvent>();
  }

  if (int_status & USB_RXFLVI_M) {
    DBG_ISR_LOG("USB int: RX FIFO level");
    // No need to update usb_->gintsts to indicate we have handled the
    // interrupt; this will be cleared when we read from the fifo.

    // Disable the RXFLVL interrupt.  The main USB task will re-enable it once
    // it has processed data from the FIFO.
    clear_bits(usb_->gintmsk, USB_RXFLVIMSK_M);
    send_event_from_isr<RxFifoNonEmpty>();
  }

  if (int_status & USB_OEPINT_M) {
    // OUT endpoint interrupt
    DBG_ISR_LOG("USB int: OUT endpoint");
    // No need to update usb_->gintsts to indicate we have handled the
    // interrupt; intr_out_endpoint() will update the endpoint doepint
    // register instead.
    intr_out_endpoint_main();
  }

  if (int_status & USB_IEPINT_M) {
    // IN endpoint interrupt
    DBG_ISR_LOG("USB int: IN endpoint");
    // No need to update usb_->gintsts to indicate we have handled the
    // interrupt; intr_in_endpoint() will update the endpoint diepint
    // register instead.
    intr_in_endpoint_main();
  }

  if (int_status & USB_MODEMIS_M) {
    // This interrupt means we tried to access a host-mode-only register
    // while in device mode.  This should only happen if we have a bug.
    usb_->gintsts = USB_MODEMIS_M;
    ESP_EARLY_LOGE(LogTag, "bug: USB_MODEMIS_M interrupt fired");
  }

  if (int_status & USB_OTGINT_M) {
    usb_->gintsts = USB_OTGINT_M;
    ESP_EARLY_LOGI(LogTag, "USB OTG interrupt");
  }

  // Clear other interrupt bits that we do not handle.
  // (This is probably unnecessary since never enable these in gintmsk)
  usb_->gintsts = USB_CURMOD_INT_M | USB_NPTXFEMP_M | USB_GINNAKEFF_M |
                  USB_GOUTNAKEFF | USB_ISOOUTDROP_M | USB_EOPF_M | USB_EPMIS_M |
                  USB_INCOMPISOIN_M | USB_INCOMPIP_M | USB_FETSUSP_M |
                  USB_PRTLNT_M | USB_HCHLNT_M | USB_PTXFEMP_M |
                  USB_CONIDSTSCHNG_M | USB_SESSREQINT_M;
  DBG_ISR_LOG("USB interrupt 0x%02" PRIx32 " done", int_status);
}

void Esp32Device::intr_bus_reset() {
  DBG_ISR_LOG("USB int: reset");
  // Configure all endpoints to NAK any new packets
  all_endpoints_nak();
  // Clear the device address
  clear_bits(usb_->dcfg, USB_DEVADDR_M);

  // Disable all endpoint interrupts
  usb_->daintmsk = 0;
  usb_->doepmsk = USB_SETUPMSK_M | USB_XFERCOMPLMSK;
  usb_->diepmsk = USB_TIMEOUTMSK_M | USB_DI_XFERCOMPLMSK_M;

  send_event_from_isr<BusResetEvent>();
}

void Esp32Device::intr_enum_done() {
  // The Device Status register (DSTS_REG) contains the enumerated speed
  // We pretty much always expect this to be Speed::Full48Mhz.  In theory if we
  // are connected to a host that only supports low speed we could see
  // Speed::Low6Mhz.
  uint32_t enum_spd = (usb_->dsts >> USB_ENUMSPD_S) & (USB_ENUMSPD_V);
  DBG_ISR_LOG("USB int: enumeration done; speed=%d", enum_spd);

  UsbSpeed speed;
  if (enum_spd == Speed::Full48Mhz) {
    speed = UsbSpeed::Full;
  } else {
    speed = UsbSpeed::Low;
  }

  send_event_from_isr<BusEnumDone>(speed);
}

DeviceEvent Esp32Device::process_rx_fifo() {
  // Process entries from the FIFO until we encounter an event to return to the
  // application, or until the FIFO is empty.
  while (true) {
    // Pop the control word from the top of the RX FIFO
    uint32_t const ctrl_word = usb_->grxstsp;
    auto event = process_one_rx_entry(ctrl_word);
    if (!std::holds_alternative<NoEvent>(event)) {
      // If the FIFO still has data to process, add another RxFifoNonEmpty
      // event to the front of the queue so we will check if there is still
      // more to process in the RX FIFO the next time wait_for_event() is
      // called.
      if ((usb_->gintsts & USB_RXFLVI_M) == 0) {
        pending_event_ = RxFifoNonEmpty();
      } else {
        // Re-enable the RXFLVL interrupt to be notified when there is more
        // data in the fifo.
        set_bits(usb_->gintmsk, USB_RXFLVIMSK_M);
      }
      return event;
    }

    // If USB_RXFLVI_M is no longer set in GINTSTS, there is nothing more to
    // read from the RX FIFO.
    if ((usb_->gintsts & USB_RXFLVI_M) == 0) {
      // Re-enable the RXFLVL interrupt to be notified when there is more
      // data in the fifo.
      set_bits(usb_->gintmsk, USB_RXFLVIMSK_M);
      return NoEvent(NoEventReason::HwProcessing);
    }
  }
}

