simpkins/ausb/ausb/esp/Esp32Device.cpp
/*
 * Process one entry from the RX FIFO
 */
DeviceEvent Esp32Device::process_one_rx_entry(uint32_t ctrl_word) {
  // USB_PKTSTS values from the comments in soc/usb_reg.h
  enum Pktsts : uint32_t {
    GlobalOutNak = 1,
    PktReceived = 2,
    TxComplete = 3,
    SetupComplete = 4,
    DataToggleError = 5, // host mode only
    SetupReceived = 6,
    ChannelHalted = 7, // host mode only
  };

  uint8_t const pktsts = (ctrl_word & USB_PKTSTS_M) >> USB_PKTSTS_S;
  switch (pktsts) {
  case Pktsts::PktReceived: {
    uint8_t const endpoint_num = (ctrl_word & USB_CHNUM_M) >> USB_CHNUM_S;
    uint16_t const byte_count = (ctrl_word & USB_BCNT_M) >> USB_BCNT_S;
    ESP_LOGD(LogTag, "USB RX: OUT packet received on EP%u; size=%u",
             endpoint_num, byte_count);
    receive_packet(endpoint_num, byte_count);
    return NoEvent(NoEventReason::HwProcessing);
  }
  case Pktsts::SetupComplete: {
    // SetupComplete is generated by the HW after the SETUP phase is done.
    // From reading the documentation, it sounds like the HW may wait to see
    // and NAK the first IN or OUT token from the host before generating this
    // interrupt, but it isn't 100% clear about this.  It seems like the HW was
    // designed this way in order to make it easier for the software to detect
    // and discard duplicate SETUP packets that were retransmitted due to the
    // host thinking there may have been a transmission error.
    //
    // Many other USB HW implementations don't behave this way, so our higher
    // level application code still needs to explicitly handle retransmitted
    // SETUP packets on other hardware.
    uint8_t const endpoint_num = (ctrl_word & USB_CHNUM_M) >> USB_CHNUM_S;
    ESP_LOGD(LogTag, "USB RX: setup done EP%d", endpoint_num);

    // Reset the doeptsiz register to indicate that we can receive more SETUP
    // packets.
    set_bits(usb_->out_ep_reg[endpoint_num].doeptsiz, USB_SUPCNT0_M);
    return NoEvent(NoEventReason::HwProcessing);
  }
  case Pktsts::SetupReceived: {
    // We store the setup packet in a dedicated member variable rather than a
    // normal RX buffer.  The host may retransmit SETUP packets, and the packet
    // data itself does not indicate if this is a retransmission.  If we
    // receive multiple SETUP packets in a row before notifying the main task
    // of receipt, we simply overwrite the data from previous packets.
    //
    // We should receive a SetupComplete interrupt after SetupReceived, follwed
    // by an OUT interrupt with the USB_SETUP0_M flag set.
    //
    // We wait to inform the main USB task of the SETUP packet until we get the
    // final OUT interrupt.  We don't want to inform the software yet, since
    // the HW will reset doeptsiz and doepctl when the setup OUT interrupt is
    // generated, and we don't want the software to attempt to start its own
    // new out transfer before we have finished processing the out interrupt
    // for this setup event.
    volatile uint32_t *rx_fifo = usb_->fifo[0];

    // assert that the byte count is exactly the length of a SETUP packet.
    assert(((ctrl_word & USB_BCNT_M) >> USB_BCNT_S) == 8);

    setup_packet_.u32[0] = (*rx_fifo);
    setup_packet_.u32[1] = (*rx_fifo);
    ESP_LOGD(LogTag, "USB RX: setup packet: 0x%08" PRIx32" 0x%08" PRIx32,
             setup_packet_.u32[0], setup_packet_.u32[1]);
    return NoEvent(NoEventReason::HwProcessing);
  }
  case Pktsts::GlobalOutNak:
    ESP_LOGD(LogTag, "USB RX: Global OUT NAK effective");
    break;
  case Pktsts::TxComplete:
    ESP_LOGD(LogTag, "USB RX: OUT packet done");
    break;
  default:
    ESP_LOGE(LogTag, "USB RX: unexpected pktsts value: %x", pktsts);
    break;
  }

  return NoEvent(NoEventReason::HwProcessing);
}

void Esp32Device::intr_out_endpoint_main() {
  for (uint8_t epnum = 0; epnum < USB_OUT_EP_NUM; ++epnum) {
    if (usb_->daint & (1 << (16 + epnum))) {
      intr_out_endpoint(epnum);
    }
  }
}

void Esp32Device::intr_in_endpoint_main() {
  for (uint8_t epnum = 0; epnum < USB_IN_EP_NUM; ++epnum) {
    if (usb_->daint & (1 << epnum)) {
      intr_in_endpoint(epnum);
    }
  }
}

void Esp32Device::intr_out_endpoint(uint8_t endpoint_num) {
  const auto doepint = usb_->out_ep_reg[endpoint_num].doepint;
  DBG_ISR_LOG("USB OUT interrupt: EP%u DOEPINT=%" PRIx32, endpoint_num,
              doepint);

  // Clear all of the interrupt flags we handle
  set_bits(usb_->out_ep_reg[endpoint_num].doepint,
           doepint & (USB_SETUP0_M | USB_STUPPKTRCVD0_M | USB_XFERCOMPL0_M));
  send_event_from_isr<OutEndpointInterrupt>(endpoint_num, doepint);
}

void Esp32Device::intr_in_endpoint(uint8_t endpoint_num) {
  const auto diepint = usb_->in_ep_reg[endpoint_num].diepint;
  DBG_ISR_LOG("USB IN interrupt: EP%u DIEPINT=%" PRIx32, endpoint_num, diepint);

  // If the TX FIFO is empty, clear the interrupt mask to stop receiving this
  // interrupt until we re-enable it.
  if (diepint & USB_D_TXFEMP0_M) {
    clear_bits(usb_->dtknqr4_fifoemptymsk, 1 << endpoint_num);
  }
  // Clear all of the interrupt flags we handle
  set_bits(usb_->in_ep_reg[endpoint_num].diepint,
           diepint & (USB_D_XFERCOMPL0_M | USB_D_TXFEMP0_M | USB_D_TIMEOUT0_M));
  send_event_from_isr<InEndpointInterrupt>(endpoint_num, diepint);
}

void Esp32Device::receive_packet(uint8_t endpoint_num, uint16_t packet_size) {
  // We currently operate in what the ESP32-S3 Technical Reference Manual
  // describes as "Slave mode", and manually read data from the RX FIFO.
  //
  // The device also supports using DMA to directly place data into our memory.
  // It would probably be nicer to use DMA mode in the future, but the
  // documentation for DMA functionality is somewhat limited and I haven't
  // spent much time playing around with it.

  // All RX transfers are performed using FIFO 0.
  volatile uint32_t *rx_fifo = usb_->fifo[0];

  auto &xfer = out_transfers_[endpoint_num];
  if (xfer.status != OutEPStatus::Busy) {
    // It's possible that this could happen if we recently processed
    // application-initiated request to abort the transfer and this raced
    // with us receiving the interrupt.
    ESP_LOGD(LogTag,
             "OUT data available endpoint %d (%" PRIu16 " bytes), but transfer "
             "is no longer in progress",
             endpoint_num, packet_size);
    // Read and discard the data
    for (size_t n = 0; n < packet_size; n += sizeof(uint32_t)) {
      const uint32_t ignored = (*rx_fifo);
      static_cast<void>(ignored);
    }
    return;
  }

