simpkins/ausb/ausb/esp/Esp32Device.cpp
  const auto words_in_fifo =
      (packet_size + sizeof(uint32_t) - 1) / sizeof(uint32_t);
  auto capacity_left = xfer.capacity - xfer.bytes_read;

  // Read as many full words as are available and fit in the destination buffer
  const uint32_t full_words_to_copy =
      std::min(static_cast<uint32_t>(packet_size), capacity_left) /
      sizeof(uint32_t);
  ESP_LOGV(LogTag, "EP%d out: copy %" PRIu32 " full words", endpoint_num,
           full_words_to_copy);
  auto* buf = static_cast<uint8_t*>(xfer.data) + xfer.bytes_read;
  xfer.bytes_read += packet_size;
  for (uint32_t n = 0; n < full_words_to_copy; ++n) {
    const uint32_t word = (*rx_fifo);
    // Use memcpy() since buf may not be word-aligned.
    // Compilers should be smart about optimizing small fixed-size memcpy()
    // calls into direct memory accesses when possible calls these days.
    memcpy(buf, &word, sizeof(uint32_t));
    buf += sizeof(uint32_t);
  }

  // Return now if we have read everything from the FIFO
  if (full_words_to_copy == words_in_fifo) {
    assert(packet_size % sizeof(uint32_t) == 0);
    return;
  }
  const auto bytes_left = packet_size - (full_words_to_copy * sizeof(uint32_t));
  assert(bytes_left > 0);
  capacity_left -= sizeof(uint32_t) * full_words_to_copy;

  // We may have more capacity for a partial packet
  auto words_read = full_words_to_copy;
  if (capacity_left > 0) {
    ESP_LOGV(LogTag, "EP%d out: copy partial word of %" PRIu32 " bytes",
             endpoint_num, std::min(capacity_left, bytes_left));
    assert(capacity_left < sizeof(uint32_t));
    const uint32_t word = (*rx_fifo);
    memcpy(buf, &word, std::min(capacity_left, bytes_left));
    ++words_read;
  }

  // Read and discard any remaining words in the FIFO if we have a buffer
  // overrun
  while (words_read < words_in_fifo) {
    assert(xfer.bytes_read > xfer.capacity);
    const uint32_t word = (*rx_fifo);
    static_cast<void>(word);
  }
}

} // namespace ausb
